Revit 2027 API
Transform2D Properties
The Transform2D type exposes the following members.
Properties
Name | Description
BasisU |  The image of (1, 0) under OfVector(UV).
BasisV |  The image of (0, 1) under OfVector(UV).
Determinant |  The determinant of this transformation.
HasReflection |  The boolean value that indicates whether this transformation produces reflection (i.e., is orientation-reversing).
IsConformal |  The boolean value that indicates whether this transformation is conformal.
IsIdentity |  The boolean value that indicates whether this transformation is an identity.
IsTranslation |  The boolean value that indicates whether this transformation is a translation.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Origin |  The image of (0, 0) under OfPoint(UV). This defines the translational part of the transform.
Scale |  The real number that represents the scale of the conformal transformation.
Top
See Also
Reference
Transform2D Class
Autodesk.Revit.DB Namespace